; ====================================================================================================
; Neo's AutoHotKey
; ====================================================================================================


; キーコード調査用 : View → Key History
;#InstallKeybdHook

; Win + Space キーによる IME 切替を無効化する
;#Space:: Return

; BackSpace コンビネーションを Delete 扱いにする
^BS:: Send, {Del}  ; Ctrl
!BS:: Send, {Del}  ; Alt


; Alt 単独で IME を切り替える
; ====================================================================================================

#Include NeosAutoHotKey-alt-ime-ahk.ahk


; ----------------------------------------------------------------------------------------------------
